In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('files/titanic.csv',usecols=['survived','pclass','age','sex','fare'])

In [3]:
data.head()

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
data_sex = data.groupby('sex')

In [5]:
data_sex.mean()

        survived    pclass        age       fare
sex
female  0.742038  2.159236  27.915709  44.479818
male    0.188908  2.389948  30.726645  25.523893

In [6]:
male_female = list(data_sex)

In [7]:
male_female

[('female',      survived  pclass     sex   age     fare
  1           1       1  female  38.0  71.2833
  2           1       3  female  26.0   7.9250
  3           1       1  female  35.0  53.1000
  8           1       3  female  27.0  11.1333
  9           1       2  female  14.0  30.0708
  ..        ...     ...     ...   ...      ...
  880         1       2  female  25.0  26.0000
  882         0       3  female  22.0  10.5167
  885         0       3  female  39.0  29.1250
  887         1       1  female  19.0  30.0000
  888         0       3  female   NaN  23.4500

  [314 rows x 5 columns]), ('male',      survived  pclass   sex   age     fare
  0           0       3  male  22.0   7.2500
  4           0       3  male  35.0   8.0500
  5           0       3  male   NaN   8.4583
  6           0       1  male  54.0  51.8625
  7           0       3  male   2.0  21.0750
  ..        ...     ...   ...   ...      ...
  883         0       2  male  28.0  10.5000
  884         0       3  male  25.0   7.0500
  886         0       2  male  27.0  13.0000
  889         1       1  male  26.0  30.0000
  890         0       3  male  32.0   7.7500

  [577 rows x 5 columns])]

In [8]:
female_group = male_female[0][1]

In [9]:
female_group

     survived  pclass     sex   age     fare
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
8           1       3  female  27.0  11.1333
9           1       2  female  14.0  30.0708
..        ...     ...     ...   ...      ...
880         1       2  female  25.0  26.0000
882         0       3  female  22.0  10.5167
885         0       3  female  39.0  29.1250
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500

[314 rows x 5 columns]

In [10]:
female_group.mean()

survived     0.742038
pclass       2.159236
age         27.915709
fare        44.479818
dtype: float64

In [11]:
def group_mean(group):
    return group.mean()

In [12]:
group_mean(female_group)

survived     0.742038
pclass       2.159236
age         27.915709
fare        44.479818
dtype: float64

In [13]:
data_sex.apply(group_mean)

        survived    pclass        age       fare
sex
female  0.742038  2.159236  27.915709  44.479818
male    0.188908  2.389948  30.726645  25.523893

In [14]:
 #defining fucntion to calculate top 5 member of highest age

In [15]:
data.nlargest(5,'age')

     survived  pclass   sex   age     fare
630         1       1  male  80.0  30.0000
851         0       3  male  74.0   7.7750
96          0       1  male  71.0  34.6542
493         0       1  male  71.0  49.5042
116         0       3  male  70.5   7.7500

In [16]:
def five_oldest(group):
    return group[group['survived']==1].nlargest(5,'age')

In [17]:
data_sex

In [18]:
data_sex.apply(five_oldest)

            survived  pclass     sex   age     fare
sex
female 275         1       1  female  63.0  77.9583
       483         1       3  female  63.0   9.5875
       829         1       1  female  62.0  80.0000
       366         1       1  female  60.0  75.2500
       11          1       1  female  58.0  26.5500
male   630         1       1    male  80.0  30.0000
       570         1       2    male  62.0  10.5000
       587         1       1    male  60.0  79.2000
       647         1       1    male  56.0  35.5000
       449         1       1    male  52.0  30.5000

In [20]:
#######################################
##
##MULTIPLE INDEX WITH GORUPBY
##
########################################

In [21]:
data.head()

   survived  pclass     sex   age     fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [23]:
data_sexPclass = data.groupby(['sex','pclass'])

In [25]:
summary = data_sexPclass.mean()

In [26]:
summary

               survived        age        fare
sex    pclass
female 1       0.968085  34.611765  106.125798
       2       0.921053  28.722973   21.970121
       3       0.500000  21.750000   16.118810
male   1       0.368852  41.281386   67.226127
       2       0.157407  30.740707   19.741782
       3       0.135447  26.507589   12.661633

In [27]:
summary.index

MultiIndex([('female', 1),
            ('female', 2),
            ('female', 3),
            (  'male', 1),
            (  'male', 2),
            (  'male', 3)],
           names=['sex', 'pclass'])

In [29]:
summary.loc[('female',2),:]

survived     0.921053
age         28.722973
fare        21.970121
Name: (female, 2), dtype: float64

In [30]:
summary.loc[('female',2),'age']

28.722972972972972

In [31]:
###swapping index

In [32]:
summary.swaplevel().sort_index()

               survived        age        fare
pclass sex
1      female  0.968085  34.611765  106.125798
       male    0.368852  41.281386   67.226127
2      female  0.921053  28.722973   21.970121
       male    0.157407  30.740707   19.741782
3      female  0.500000  21.750000   16.118810
       male    0.135447  26.507589   12.661633

In [33]:
summary.reset_index()

      sex  pclass  survived        age        fare
0  female       1  0.968085  34.611765  106.125798
1  female       2  0.921053  28.722973   21.970121
2  female       3  0.500000  21.750000   16.118810
3    male       1  0.368852  41.281386   67.226127
4    male       2  0.157407  30.740707   19.741782
5    male       3  0.135447  26.507589   12.661633